<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"47832c03ff2456cd4f5582e6196fcfaf2299a0454e6a71a9bf4832122a5703a9","plan_job_ref":"Job Terraform Plan #444 at https://github.com/cal-itp/data-infra/actions/runs/16951525256","plan_out_hash":"1dc4db69a41a063f92a21b0ac48253dd7ab9d8220712382c5f9f08f8cfa61a6d","plan_hash":"2d7749c667e795dd2a2e025f529e577aea4682d30dd9587e80fbf81bc28e1b51","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/iam/us__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_project_iam_custom_role.metabase_additional will be created
+   resource "google_project_iam_custom_role" "metabase_additional" {
+       deleted     = (known after apply)
+       description = "Extra permission to view all BigQuery query jobs for cost estimation"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "bigquery.jobs.listAll",
        ]
+       project     = "cal-itp-data-infra"
+       role_id     = "******************"
+       stage       = "GA"
+       title       = "Metabase additional custom permission jobs.listAll"
    }

  # google_project_iam_custom_role.tfer--projects-002F-cal-itp-data-infra-002F-roles-002F-DataAnalyst will be updated in-place
!~  resource "google_project_iam_custom_role" "tfer--projects-002F-cal-itp-data-infra-002F-roles-002F-DataAnalyst" {
        id          = "projects/cal-itp-data-infra/roles/DataAnalyst"
        name        = "projects/cal-itp-data-infra/roles/DataAnalyst"
!~      permissions = [
+           "bigquery.jobs.listAll",
#            (28 unchanged elements hidden)
        ]
#        (6 unchanged attributes hidden)
    }

  # google_project_iam_member.metabase_custom_role_assignment will be created
+   resource "google_project_iam_member" "metabase_custom_role_assignment" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:metabase@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #444](https://github.com/cal-itp/data-infra/actions/runs/16951525256)